# Documentation examples

#### Test data is available at: https://github.com/dmitrykoval/vinum-test-data

In [1]:
import vinum as vn
vn.__version__

'0.3.0'

## IO examples
### vinum/io/arrow.py

#### Stream CSV

In [2]:
import vinum as vn
query = 'select passenger_count pc, count(*) from t group by pc'
vn.stream_csv('taxi.csv').sql(query).to_pandas()

   pc  count_star
0   0         165
1   5        3453
2   6         989
3   1       34808
4   2        7386
5   3        2183
6   4        1016

#### CSV

In [3]:
import vinum as vn
tbl = vn.read_csv('taxi.csv')
res_tbl = tbl.sql('select key, fare_amount from t limit 3')
res_tbl.to_pandas()

                            key  fare_amount
0   2009-06-15 17:26:21.0000001          4.5
1   2010-01-05 16:52:16.0000002         16.9
2  2011-08-18 00:35:00.00000049          5.7

#### JSON

In [4]:
import vinum as vn
tbl = vn.read_json('cities.json')
tbl.sql_pd('select * from t limit 3')

   id  origin    destination    fare
0   1  London  San Francisco  1348.1
1   2  Berlin         London   256.3
2   3  Munich         Malaga   421.7

#### Parquet

In [5]:
import vinum as vn
tbl = vn.read_parquet('taxi.parquet')
tbl.sql_pd('select key, fare_amount from t limit 3')

                            key  fare_amount
0   2009-06-15 17:26:21.0000001          4.5
1   2010-01-05 16:52:16.0000002         16.9
2  2011-08-18 00:35:00.00000049          5.7

## StreamReader examples
### vinum/api/stream_reader.py

In [6]:
import vinum as vn
query = 'select passenger_count pc, count(*) from t group by pc'
vn.stream_csv('taxi.csv').sql(query).to_pandas()

   pc  count_star
0   0         165
1   5        3453
2   6         989
3   1       34808
4   2        7386
5   3        2183
6   4        1016

## Table examples
### vinum/api/table.py

#### Constructor

In [7]:
import pyarrow as pa
import vinum as vn
data = {'col1': [1, 2, 3], 'col2': [7, 13, 17]}
arrow_table = pa.Table.from_pydict(data)
tbl = vn.Table(arrow_table)
tbl.sql_pd('select * from t')

   col1  col2
0     1     7
1     2    13
2     3    17

In [8]:
import pandas as pd
import vinum as vn
pdf = pd.DataFrame(data={'col1': [1, 2, 3], 'col2': [7, 13, 17]})
tbl = vn.Table.from_pandas(pdf)
tbl.sql('select * from t')

In [9]:
tbl.sql_pd('select * from t')

   col1  col2
0     1     7
1     2    13
2     3    17

In [10]:
import vinum as vn
vn.register_numpy('product', lambda x, y: x*y)
tbl.sql_pd('select product(col1, col2) from t')

   product
0        7
1       26
2       51

#### from_pydict()

In [11]:
import vinum as vn
data = {'col1': [1, 2, 3], 'col2': [7, 13, 17]}
tbl = vn.Table.from_pydict(data)
tbl.sql_pd('select * from t')

   col1  col2
0     1     7
1     2    13
2     3    17

#### from_arrow()

In [12]:
import pyarrow as pa
import vinum as vn
data = {'col1': [1, 2, 3], 'col2': [7, 13, 17]}
arrow_table = pa.Table.from_pydict(data)
tbl = vn.Table.from_arrow(arrow_table)
tbl.sql_pd('select * from t')

   col1  col2
0     1     7
1     2    13
2     3    17

#### from_pandas()

In [13]:
import pandas as pd
import vinum as vn
data = {'col1': [1, 2, 3], 'col2': [7, 13, 17]}
pdf = pd.DataFrame(data=data)
tbl = vn.Table.from_pandas(pdf)
tbl.sql_pd('select * from t')

   col1  col2
0     1     7
1     2    13
2     3    17

#### sql()

In [14]:
import pandas as pd
import vinum as vn
data = {'col1': [1, 2, 3], 'col2': [7, 13, 17]}
pdf = pd.DataFrame(data=data)
tbl = vn.Table.from_pandas(pdf)
res_tbl = tbl.sql('select * from t')
res_tbl.to_pandas()

   col1  col2
0     1     7
1     2    13
2     3    17

In [15]:
import vinum as vn
tbl = vn.read_csv('taxi.csv')
res_tbl = tbl.sql('select key, fare_amount from t limit 3')
res_tbl.to_pandas()

                            key  fare_amount
0   2009-06-15 17:26:21.0000001          4.5
1   2010-01-05 16:52:16.0000002         16.9
2  2011-08-18 00:35:00.00000049          5.7

In [16]:
import vinum as vn
tbl = vn.read_csv('taxi.csv')
res_tbl = tbl.sql('select to_int(fare_amount) fare, count(*) from t '
                  'group by fare order by fare limit 3')
res_tbl.to_pandas()

   fare  count_star
0    -5           1
1    -3           1
2    -2           4

#### sql_pd()

In [17]:
import pandas as pd
import vinum as vn
data = {'col1': [1, 2, 3], 'col2': [7, 13, 17]}
pdf = pd.DataFrame(data=data)
tbl = vn.Table.from_pandas(pdf)
tbl.sql_pd('select * from t')

   col1  col2
0     1     7
1     2    13
2     3    17

In [18]:
import vinum as vn
tbl = vn.read_csv('taxi.csv')
tbl.sql_pd('select key, passenger_count from t limit 3')

                            key  passenger_count
0   2009-06-15 17:26:21.0000001                1
1   2010-01-05 16:52:16.0000002                1
2  2011-08-18 00:35:00.00000049                2

In [19]:
import vinum as vn
tbl = vn.read_csv('taxi.csv')
tbl.sql_pd('select to_int(fare_amount) fare, count(*) from t '
           'group by fare order by fare limit 3')

   fare  count_star
0    -5           1
1    -3           1
2    -2           4

#### Explain

In [20]:
import vinum as vn
tbl = vn.read_csv('taxi.csv')
print(tbl.explain('select to_int(fare_amount) fare, count(*) from t '
                  'group by fare order by fare limit 3'))

Query plan:
   Operator: MaterializeTableOperator

    Operator: SliceOperator

      Operator: ProjectOperator
          Column: to_int_4656882976
          Column: count_star_4656882544

        Operator: SortOperator
            Column: to_int_4656882976

          Operator: AggregateOperator

            Operator: ProjectOperator
              VectorizedExpression: IntCastFunction
                  Column: fare_amount


              Operator: ProjectOperator
                  Column: fare_amount

                Operator: TableReaderOperator

## UDFs
### vinum/core/udf.py

#### register_python()

In [33]:
import vinum as vn
vn.register_python('cube', lambda x: x**3)
tbl = vn.Table.from_pydict({'len': [1, 2, 3], 'size': [7, 13, 17]})
tbl.sql_pd('SELECT cube(size) from t ORDER BY cube(size) DESC')

   cube
0  4913
1  2197
2   343

In [34]:
import math
import vinum as vn
vn.register_python('distance', lambda x, y: math.sqrt(x**2 + y**2))
tbl = vn.Table.from_pydict({'x': [1, 2, 3], 'y': [7, 13, 17]})
tbl.sql_pd('select x, y, distance(x, y) as dist from t')

   x   y       dist
0  1   7   7.071068
1  2  13  13.152946
2  3  17  17.262677

In [35]:
import vinum as vn
def sin_taylor(x):
    "Taylor series approximation of the sine trig function around 0."
    return x - x**3/6 + x**5/120 - x**7/5040

vn.register_python('sin', sin_taylor)
tbl = vn.Table.from_pydict({'x': [1, 2, 3], 'y': [7, 13, 17]})
tbl.sql_pd('select sin(x) as sin_x, sin(y) as sin_y from t '
           'order by sin_y')

      sin_x     sin_y
0  0.141120 -0.961397
1  0.909297  0.420167
2  0.841471  0.656987

#### register_numpy()

In [36]:
import numpy as np
import vinum as vn
vn.register_numpy('cube', lambda x: np.power(x, 3))
tbl = vn.Table.from_pydict({'len': [1, 2, 3], 'size': [7, 13, 17]})
tbl.sql_pd('SELECT cube(size) from t ORDER BY cube(size) DESC')

   cube
0  4913
1  2197
2   343

In [37]:
import numpy as np
import vinum as vn
vn.register_numpy('distance', 
                  lambda x, y: np.sqrt(np.square(x) + np.square(y)))
tbl = vn.Table.from_pydict({'x': [1, 2, 3], 'y': [7, 13, 17]})
tbl.sql_pd('select x, y, distance(x, y) as dist from t')

   x   y       dist
0  1   7   7.071068
1  2  13  13.152946
2  3  17  17.262677

In [38]:
import numpy as np
import vinum as vn
def z_score(x: np.array):
    "Compute Standard Score"
    mean = np.mean(x)
    std = np.std(x)
    return (x - mean) / std

vn.register_numpy('score', z_score)
tbl = vn.Table.from_pydict({'x': [1, 2, 3], 'y': [7, 13, 17]})
tbl.sql_pd('select x, score(x), y, score(y) from t')

   x     score   y   score_1
0  1 -1.224745   7 -1.297771
1  2  0.000000  13  0.162221
2  3  1.224745  17  1.135550

# Readme.rst

#### Query python dict

In [39]:
import vinum as vn
data = {'value': [300.1, 2.8, 880], 'mode': ['air', 'bus', 'air']}
tbl = vn.Table.from_pydict(data)
tbl.sql_pd("SELECT value, np.log(value) FROM t WHERE mode='air'")

   value    np.log
0  300.1  5.704116
1  880.0  6.779922

#### Query pandas dataframe

In [40]:
import pandas as pd
import vinum as vn
data = {'col1': [1, 2, 3], 'col2': [7, 13, 17]}
pdf = pd.DataFrame(data=data)
tbl = vn.Table.from_pandas(pdf)
tbl.sql_pd('SELECT * FROM t WHERE col2 > 10 ORDER BY col1 DESC')

   col1  col2
0     3    17
1     2    13

#### Run query on a csv stream

In [43]:
import vinum as vn
query = 'select passenger_count pc, count(*) from t group by pc'
vn.stream_csv('taxi.csv').sql(query).to_pandas()

   pc  count_star
0   0         165
1   5        3453
2   6         989
3   1       34808
4   2        7386
5   3        2183
6   4        1016

#### Query csv

In [44]:
import vinum as vn
tbl = vn.read_csv('taxi.csv')
res_tbl = tbl.sql('SELECT key, fare_amount, passenger_count FROM t '
                  'WHERE fare_amount > 5 LIMIT 3')
res_tbl.to_pandas()

                            key  fare_amount  passenger_count
0   2010-01-05 16:52:16.0000002         16.9                1
1  2011-08-18 00:35:00.00000049          5.7                2
2   2012-04-21 04:30:42.0000001          7.7                1

#### Compute Euclidean distance with numpy functions

In [45]:
import vinum as vn
tbl = vn.Table.from_pydict({'x': [1, 2, 3], 'y': [7, 13, 17]})
tbl.sql_pd('SELECT *, np.sqrt(np.square(x) + np.square(y)) dist '
           'FROM t ORDER BY dist DESC')

   x   y       dist
0  3  17  17.262677
1  2  13  13.152946
2  1   7   7.071068

#### Compute Euclidean distance with vectorized UDF

In [46]:
import vinum as vn
vn.register_numpy('distance', 
                  lambda x, y: np.sqrt(np.square(x) + np.square(y)))
tbl = vn.Table.from_pydict({'x': [1, 2, 3], 'y': [7, 13, 17]})
tbl.sql_pd('SELECT *, distance(x, y) AS dist '
           'FROM t ORDER BY dist DESC')

   x   y       dist
0  3  17  17.262677
1  2  13  13.152946
2  1   7   7.071068

#### Compute Euclidean distance with python UDF

In [47]:
import math
import vinum as vn
vn.register_python('distance', lambda x, y: math.sqrt(x**2 + y**2))
tbl = vn.Table.from_pydict({'x': [1, 2, 3], 'y': [7, 13, 17]})
tbl.sql_pd('SELECT x, y, distance(x, y) AS dist FROM t')

   x   y       dist
0  1   7   7.071068
1  2  13  13.152946
2  3  17  17.262677

#### Group by z-score

In [49]:
import numpy as np
import vinum as vn
def z_score(x: np.ndarray):
    "Compute Standard Score"
    mean = np.mean(x)
    std = np.std(x)
    return (x - mean) / std

vn.register_numpy('score', z_score)
tbl = vn.read_csv('taxi.csv')
tbl.sql_pd('select to_int(score(fare_amount)) AS bucket, avg(fare_amount), count(*) '
           'FROM t GROUP BY bucket ORDER BY bucket limit 3')

   bucket        avg  count_star
0      -1  -1.839000          10
1       0   8.817733       45158
2       1  25.155522        2376